---
kind: enumMember
id: F:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.QuantityTablePerPortion
enum: Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule
source: html/7fa26a3f-1640-4497-c60d-ac7af7624bb7.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorRule.QuantityTablePerPortion

This rule will apply the demand factor differently for each row in the table.
 For example, the first two (largest) items will have a 125% demand factor applied and the
 remaining items will have a 75% factor applied.